spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3SimpleSepaDirectDebitGateway/when_setup_purchase/handles_an_error_with_wrong_IBAN_number_the_right_way.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_channel=CALLCENTER&brq_culture=EN&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_payment_method=simplesepadirectdebit&brq_service_simplesepadirectdebit_action=Pay&brq_service_simplesepadirectdebit_collectdate=2020-08-19&brq_service_simplesepadirectdebit_customeraccountname=Berend&brq_service_simplesepadirectdebit_customerbic=INGBNL2A&brq_service_simplesepadirectdebit_customeriban=NL20INGB0001234567&brq_service_simplesepadirectdebit_mandatedate=2020-08-19&brq_service_simplesepadirectdebit_mandatereference=000-TEST-000001&brq_startrecurrent=true&brq_websitekey=<WEBSITEKEY>&brq_signature=5194732e0f7485a8c59a41a022d0210ba208de39
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 11:24:26 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '214'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d628ffb27a0decd5b638f293674a442e51597836266; expires=Fri, 18-Sep-20
        11:24:26 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a80fa46000001eda3b28c200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c53821a3a5d1eda-AMS
    body:
      encoding: ASCII-8BIT
      string: BRQ_AMOUNT=1.23&BRQ_APIERRORMESSAGE=Parameter+%22CustomerIBAN%22+has+wrong+value&BRQ_CURRENCY=EUR&BRQ_INVOICENUMBER=2013-0001&BRQ_MUTATIONTYPE=NotSet&BRQ_STATUSCODE=491&BRQ_STATUSMESSAGE=Validation+failure&BRQ_TEST=false&BRQ_TIMESTAMP=2013-12-11+13%3a33%3a26&BRQ_TRANSACTIONS=1234567890ABCDEFGHIJKLMNOPQRSTUV&BRQ_WEBSITEKEY=<WEBSITEKEY>&BRQ_SIGNATURE=07ceec5ab53a77789f6a7dee597963f61889fe84
  recorded_at: Wed, 19 Aug 2020 11:24:26 GMT
recorded_with: VCR 6.0.0
