spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3SimpleSepaDirectDebitGateway/when_setup_purchase/returns_with_no_ArumentErrors_with_default_options.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_channel=CALLCENTER&brq_culture=EN&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_payment_method=simplesepadirectdebit&brq_service_simplesepadirectdebit_action=Pay&brq_service_simplesepadirectdebit_collectdate=2020-08-19&brq_service_simplesepadirectdebit_customeraccountname=Berend&brq_service_simplesepadirectdebit_customerbic=INGBNL2A&brq_service_simplesepadirectdebit_customeriban=NL20INGB0001234567&brq_service_simplesepadirectdebit_mandatedate=2020-08-19&brq_service_simplesepadirectdebit_mandatereference=000-TEST-000001&brq_startrecurrent=true&brq_websitekey=<WEBSITEKEY>&brq_signature=5194732e0f7485a8c59a41a022d0210ba208de39
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 11:21:58 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '214'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d6c410aeec45882e95bd38b1a89cc1b001597836118; expires=Fri, 18-Sep-20
        11:21:58 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a80d61b20000bda50fbdf200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c537e7c5bfabda5-AMS
    body:
      encoding: ASCII-8BIT
      string: 'BRQ_APIRESULT=Fail&BRQ_APIERRORMESSAGE=The+mandate+reference+is+invalid.+It+should+start+with%3a+00G '
  recorded_at: Wed, 19 Aug 2020 11:21:58 GMT
recorded_with: VCR 6.0.0
