spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3SimpleSepaDirectDebitGateway/when_setup_purchase/supports_sepa_mandate_prefix_in_mandatereference_old_situation_.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_channel=CALLCENTER&brq_culture=EN&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_payment_method=simplesepadirectdebit&brq_service_simplesepadirectdebit_action=Pay&brq_service_simplesepadirectdebit_collectdate=2020-08-19&brq_service_simplesepadirectdebit_customeraccountname=Berend&brq_service_simplesepadirectdebit_customerbic=INGBNL2A&brq_service_simplesepadirectdebit_customeriban=NL20INGB0001234567&brq_service_simplesepadirectdebit_mandatedate=2020-08-19&brq_service_simplesepadirectdebit_mandatereference=000-TEST-000003&brq_startrecurrent=true&brq_websitekey=<WEBSITEKEY>&brq_signature=68df6d4a6512693d5b8b6d5916f9e32f0e11473e
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 11:21:58 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '214'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dd625194696663d3d951c25fcd4e500bc1597836117; expires=Fri, 18-Sep-20
        11:21:57 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a80d5fdc00001ec6e3bd7200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c537e796e9d1ec6-AMS
    body:
      encoding: ASCII-8BIT
      string: ""
  recorded_at: Wed, 19 Aug 2020 11:21:58 GMT
recorded_with: VCR 6.0.0
